<a href="https://colab.research.google.com/github/mimi-dotcom/mimi-dotcom/blob/main/My%20Data_Manipulation%20first%20project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Downl√∂oad and upload data sets from local drive

In [1]:
from google.colab import files
uploaded = files.upload()

Saving train.csv to train.csv

In [ ]:
#change dataset from csv to a pandas dataframe

In [2]:
import pandas as pd
import numpy as np

df_train=pd.read_csv('train.csv')
df_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
#Sort Age column in ascending order

In [ ]:
df_train_sorted=df_train.sort_values('Age',ascending=True)
df_train_sorted.head()

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
803          804         1       3  ...   8.5167   NaN         C
755          756         1       2  ...  14.5000   NaN         S
644          645         1       3  ...  19.2583   NaN         C
469          470         1       3  ...  19.2583   NaN         C
78            79         1       2  ...  29.0000   NaN         S

[5 rows x 12 columns]

In [ ]:
#call age column and print the first 5 rows

In [ ]:
df_train['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [ ]:
#How call two columns name and age

In [ ]:
df_train[['Name','Age']].head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [5]:
#How to subset datadrame to eg to an age less than 30

df_train_subset_lessthan30=df_train[df_train['Age']<35]
df_train_subset.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
2            3         1       3  ...   7.9250   NaN         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [ ]:
#subsetting columns and filtering in this case subset sex to female less than 35 years old

In [6]:
df_train_sex_age= df_train[(df_train['Sex']=='female') & (df_train['Age']<35)]
df_train_sex_age.head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
2             3         1       3  ...   7.9250   NaN         S
8             9         1       3  ...  11.1333   NaN         S
9            10         1       2  ...  30.0708   NaN         C
10           11         1       3  ...  16.7000    G6         S
14           15         0       3  ...   7.8542   NaN         S

[5 rows x 12 columns]

In [10]:
df_train_subsetto=df_train[['Sex','Age']]
df_train_subsetto.head()

      Sex   Age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0

In [20]:
df_train_neo=df_train_subsetto[(df_train_subsetto['Sex']=='female') & (df_train_subsetto['Age']<35)]
df_train_neo.head()

       Sex   Age
2   female  26.0
8   female  27.0
9   female  14.0
10  female   4.0
14  female  14.0